{
  "categories": [
    {
      "name": "Cómputo",
      "services": [
        {
          "name": "Amazon EC2 (Elastic Compute Cloud)",
          "description": "Amazon Elastic Compute Cloud (Amazon EC2) proporciona capacidad de computación escalable bajo demanda en la nube de Amazon Web Services (AWS). El uso de Amazon EC2 reduce los costos de hardware para que pueda desarrollar e implementar aplicaciones con mayor rapidez. Puede usar Amazon EC2 para lanzar tantos servidores virtuales como necesite, configurar la seguridad y las redes, y administrar el almacenamiento. Puede agregar capacidad (escalar verticalmente) para gestionar tareas que requieren mucha computación, como los procesos mensuales o anuales, o los picos de tráfico del sitio web. Cuando el uso disminuye, puede volver a reducir la capacidad (reducir verticalmente).<br><br>Una instancia de EC2 es un servidor virtual en la nube de AWS. Cuando inicia una instancia de EC2, el tipo de instancia que especifica determina el hardware disponible para la instancia. Cada tipo de instancia ofrece una combinación diferente de recursos de computación, memoria, red y almacenamiento. Para obtener más información, consulte la Guía de tipos de instancia de Amazon EC2.",
          "image": "imagen/AWS-EC2.png"
        },
        {
          "name": "AWS Lambda",
          "description": "AWS Lambda es un servicio de computación que ejecuta código sin necesidad de administrar servidores. Tu código se ejecuta, escalándose automáticamente según sea necesario, con un modelo de pago por uso.<br><br>Puedes usar Lambda para:<ul><b> - Procesamiento de flujos</b>: Procese flujos de datos en tiempo real para análisis y monitorización. Consulte Kinesis Data Streams para obtener más información. </ul><ul><b> - Aplicaciones web</b>: Cree aplicaciones web escalables que se ajusten automáticamente a la demanda.</ul><ul><b> - Backends móviles</b>: Crea backends de API seguros para aplicaciones móviles y web.</ul><ul><b> - Backends de IoT</b>: Gestionan solicitudes web, móviles, de IoT y de API de terceros. Consulte la sección de IoT para obtener más información.</ul><ul><b>- Procesamiento de archivos</b> : Los archivos se procesan automáticamente al subirlos a Amazon Simple Storage Service. Consulte los ejemplos de procesamiento de archivos para obtener más información.</ul><ul><b> - Ejemplos de operaciones e integración de bases de datos</b>: Responda a los cambios en la base de datos y automatice los flujos de trabajo de datos. Consulte los ejemplos de bases de datos para obtener más detalles. </ul><ul> - <b>Tareas programadas y periódicas</b> : Ejecute operaciones automatizadas de forma regular mediante EventBridge. Consulte los ejemplos de tareas programadas para obtener más información. </ul>",
          "image": ""
        },
        {
          "name": "Amazon ECS (Elastic Container Service)",
          "description": "Amazon Elastic Container Service (Amazon ECS) es un servicio de orquestación de contenedores completamente administrado que facilita la implementación, la administración y el escalado de aplicaciones en contenedores. Como servicio totalmente administrado, Amazon ECS incluye configuración y prácticas recomendadas operativas integradas de AWS. Se integra tanto con herramientas de AWS, como Amazon Elastic Container Registry, como con herramientas de terceros, como Docker. Esta integración facilita a los equipos centrarse en crear las aplicaciones, no en el entorno. Puede ejecutar y escalar las cargas de trabajo de contenedores en todas las Regiones de AWS en la nube y en las instalaciones, sin la complejidad de administrar un plano de control.",
          "image": "imagen/AWS-ECS.png"
        },
        {
          "name": "Amazon EKS (Elastic Kubernetes Service)",
          "description": "Amazon Elastic Kubernetes Service (EKS) es un servicio de Kubernetes completamente administrado que elimina la complejidad que supone operar clústeres de Kubernetes. Con EKS, es posible:<br><br><ul>Implementar aplicaciones más rápido y con menos sobrecarga operativa.</ul><ul>Escalar sin interrupciones para satisfacer las demandas cambiantes de las cargas de trabajo.</ul><ul>Mejorar la seguridad mediante la integración con AWS y actualizaciones automatizadas.</ul><ul>Puede elegir entre EKS estándar o el modo automático de EKS totalmente automatizado.</ul>",
          "image": "imagen/AWS-EKS.png"
        },
        {
          "name": "AWS Elastic Beanstalk",
          "description": "Amazon Elastic Beanstalk es un servicio de orquestación de Amazon Web Services (AWS) que simplifica la implementación, gestión y escalado de aplicaciones web en la nube. Abstrae los detalles de la infraestructura subyacente como servidores (Amazon EC2), balanceo de carga y escalado automático, permitiendo a los desarrolladores centrarse en escribir código. Es compatible con lenguajes como Java, .NET, PHP, Node.js, Python, Ruby y Docker.<br><br>Plataforma PaaS que facilita desplegar y escalar aplicaciones web (soporta Java, .NET, Node.js, Python, Ruby, Go, PHP). Gestiona automáticamente el aprovisionamiento de EC2, balanceadores, auto scaling y despliegues mientras te permite acceder a la configuración subyacente si lo necesitas. Casos de uso: rápidamente desplegar aplicaciones sin diseñar la infraestructura; ideal para prototipos y equipos que quieren simplicidad operativa. <br><br> Con Elastic Beanstalk, puede implementar aplicaciones web en la nube AWS en una variedad de plataformas compatibles. Usted crea e implementa sus aplicaciones. Elastic Beanstalk EC2 aprovisiona las instancias de Amazon, configura el equilibrio de carga, configura la supervisión del estado y escala el entorno de forma dinámica. <br><br> Además de los entornos de servidores web, Elastic Beanstalk también proporciona entornos de trabajo que puede utilizar para procesar los mensajes de una cola de Amazon SQS, útiles para tareas asíncronas o de ejecución prolongada. Para obtener más información, consulte Entornos de trabajo de Elastic Beanstalk.",
          "image": "imagen/AWS-ElasticBeanstalk.png"
        }
      ]
    },
    {
      "name": "Almacenamiento",
      "services": [
        {
          "name": "Amazon S3 (Simple Storage Service)",
          "description": "Almacenamiento de objetos duradero y altamente disponible pensado para millones de objetos. Soporta clases de almacenamiento (Standard, Intelligent-Tiering, Glacier, Glacier Deep Archive) para optimizar coste según acceso y latencia. Casos de uso: hosting de contenido estático, backups, data lake y almacenamiento para análisis. Características clave: versioning, lifecycle policies, políticas de acceso (IAM, bucket policies), encryption (SSE-S3, SSE-KMS) y eventos S3 para integraciones serverless.",
          "image": "https://d1.awsstatic.com/product-marketing/S3/Logo_AmazonS3_64.9f3f39cf655aa5e0ecb0c07c2cb9f3da0c9823aa.png"
        },
        {
          "name": "Amazon EBS (Elastic Block Store)",
          "description": "Almacenamiento en bloques persistente diseñado para ser usado por instancias EC2 (discos virtuales). Tipos de volúmenes: gp2/gp3 (general purpose), io1/io2 (IOPS alto), st1/sc1 (throughput-optimizado). Casos de uso: sistemas de archivos en instancias, bases de datos y aplicaciones con requisitos de I/O. Soporta snapshots incrementales a S3 para respaldo y restauración; ten en cuenta la dependencia entre zona de disponibilidad de la instancia y el volumen EBS.",
          "image": "https://d1.awsstatic.com/product-marketing/EBS/Logo_AmazonEBS_64.4b2e4a9dba2efc76087ff7e2b6ff4ab10b5d3a8c.png"
        },
        {
          "name": "Amazon EFS (Elastic File System)",
          "description": "Sistema de archivos NFS escalable y compartido que puede montarse desde múltiples instancias EC2 y servicios. Ofrece modos de rendimiento y clases de almacenamiento para optimizar costos y latencia, y se escala automáticamente según necesidad. Casos de uso: cargas que requieren almacenamiento compartido (contenedores, CI/CD, home directories). Ventaja: acceso concurrente y administración mínima; considera latencia y coste para I/O intensivo.",
          "image": "https://d1.awsstatic.com/product-marketing/EFS/Logo_AmazonEFS_64.7cf9b2dc8ad3e9a3f1d8e5c4b2d844da48d36d5b.png"
        },
        {
          "name": "AWS Backup",
          "description": "Servicio centralizado para automatizar políticas de backup, retención y restauración a través de múltiples servicios AWS (EBS, RDS, DynamoDB, EFS, Storage Gateway, etc.). Permite definir planes de copia, aplicar etiquetas y auditar cumplimiento, lo que facilita la gobernanza de copias de seguridad en entornos grandes. Es útil para cumplimiento y recuperación ante desastres (DR).",
          "image": "https://d1.awsstatic.com/product-marketing/Backup/Logo_AWSBackup_64.3e6d95f03e97e5c8ab7e287c6df2efdc070ddf5c.png"
        },
        {
          "name": "Amazon S3 Glacier",
          "description": "Clase de almacenamiento de Amazon S3 diseñada para archivado de datos a largo plazo a un costo muy bajo, con tiempos de recuperación que van desde minutos hasta horas. Ideal para backups, datos regulatorios, logs históricos y contenido que rara vez se accede. Permite políticas de ciclo de vida para mover datos automáticamente desde S3 Standard a Glacier.",
          "image": ""
        },
        {
          "name": "Amazon S3 Glacier Deep Archive",
          "description": "La clase de almacenamiento más económica dentro de S3, diseñada para archivado a muy largo plazo con tiempos de recuperación en horas. Pensada para datos que deben conservarse por requisitos legales, históricos o de cumplimiento, pero que se acceden muy poco (quizás una vez al año o menos). Es la alternativa más barata para almacenamiento en la nube.",
          "image": "https://d1.awsstatic.com/product-marketing/S3/Logo_AmazonS3GlacierDeepArchive_64.png"
        }
      ]
    },
    {
      "name": "Bases de Datos",
      "services": [
        {
          "name": "Amazon RDS (Relational Database Service)",
          "description": "Servicio administrado para bases de datos relacionales (MySQL, PostgreSQL, MariaDB, Oracle, SQL Server y Amazon Aurora). Gestiona tareas operativas: parcheo, backups automáticos, snapshots, recuperación y failover multi-AZ. Casos de uso: aplicaciones tradicionales que requieren SQL y transacciones. Modelos de escalado: vertical (tamaño de instancia) y réplicas de lectura; RDS simplifica operaciones pero limita cierto control comparado con bases autogestionadas.",
          "image": "https://d1.awsstatic.com/product-marketing/RDS/Logo_AmazonRDS_64.81fdb09b329dfd91b51777c6c056f5a9cf623671.png"
        },
        {
          "name": "Amazon DynamoDB",
          "description": "Base de datos NoSQL totalmente administrada, de baja latencia y escala automática. Soporta modelos de datos clave-valor y documentos, con opciones de capacidad provisionada o bajo demanda y características avanzadas como streams, TTL y Global Tables para replicación multi-región. Casos de uso: aplicaciones con requerimientos de alta concurrencia y baja latencia (juegos, IoT, e-commerce). Ventaja: sin servidores que administrar, con latencias consistentes y alta disponibilidad.",
          "image": "https://d1.awsstatic.com/product-marketing/DynamoDB/Logo_AmazonDynamoDB_64.64b9bdf65c1a7d31498ed8f1a0d8a2bca322a1e4.png"
        },
        {
          "name": "Amazon Redshift",
          "description": "Data warehouse (almacén de datos) totalmente administrado orientado a análisis a gran escala y consultas SQL complejas. Utiliza almacenamiento columnar y compresión, y ofrece opciones de nodos para rendimiento y escalado. Se integra con S3, Spectrum (consultas federadas) y herramientas BI. Casos de uso: reporting empresarial, análisis de grandes volúmenes y pipelines de datos analíticos.",
          "image": "https://d1.awsstatic.com/product-marketing/Redshift/Logo_AmazonRedshift_64.9f709b0f68de5c40cf2b041dffb5cfb6b00e218e.png"
        },
        {
          "name": "Amazon Aurora",
          "description": "Base de datos relacional compatible con MySQL y PostgreSQL diseñada por AWS para alta performance y disponibilidad. Ofrece replicación de almacenamiento, recuperación rápida y multi-AZ con réplicas de lectura escalables. Su rendimiento suele superar a instalacions tradicionales gracias a optimizaciones internas; es ideal cuando buscas compatibilidad SQL con mayor throughput y resiliencia integrada.",
          "image": "https://d1.awsstatic.com/product-marketing/Aurora/Logo_AmazonAurora_64.0ce3ecfe2416cc4ce16e43b92fdf6a476a7b69d4.png"
        }
      ]
    },
    {
      "name": "Red y Entrega de Contenido",
      "services": [
        {
          "name": "Amazon VPC (Virtual Private Cloud)",
          "description": "Servicio que permite crear redes virtuales aisladas dentro de AWS para controlar subredes, routing, tables, gateways y reglas de seguridad (security groups y network ACLs). Es la base de la mayoría de arquitecturas en AWS: define zonas públicas/privadas, conectividad VPN/Direct Connect y segmentación de servicios. Recomendación: diseñar subredes por AZ para alta disponibilidad y aplicar principios de least privilege en reglas de red.<br><br> Con Amazon Virtual Private Cloud (Amazon VPC), puede lanzar recursos de AWS en una red virtual aislada de manera lógica que haya definido. Esta red virtual es muy similar a la red tradicional que usaría en su propio centro de datos, pero con los beneficios que supone utilizar la infraestructura escalable de AWS.<br><br> En el siguiente diagrama se muestra una VPC de ejemplo. La VPC tiene una subred en cada zona de disponibilidad de la región, instancias de EC2 en cada subred y una puerta de enlace de Internet para permitir la comunicación entre los recursos en su VPC y la Internet.",
          "image": "imagen/AWS-VPC.png"
        },
        {
          "name": "Amazon CloudFront",
          "description": "Amazon CloudFront es un servicio rápido de red de entrega de contenido (CDN) que distribuye datos, vídeos, aplicaciones y API a clientes de todo el mundo de forma segura, con baja latencia, altas velocidades de transferencia y dentro de un entorno intuitivo para desarrolladores. Amazon CloudFront utiliza una red global de ubicaciones de borde y cachés de borde regional que guarda en la caché copias de su contenido cerca de los espectadores. <br>CDN (Content Delivery Network) que cachea contenido en edge locations globales para reducir latencia y mejorar la entrega de sitios web, APIs y medios. Soporta integración con S3, ALB y funciones edge (Lambda@Edge / CloudFront Functions) para personalización. Casos de uso: sitios web internacionales, streaming y APIs con usuarios distribuidos geográficamente. <br><br>Amazon CloudFront garantiza que las solicitudes del usuario final se entregan desde la ubicación de borde más próxima. El resultado es que las solicitudes del espectador recorren una distancia corta, lo que mejora el rendimiento que se ofrece a los espectadores. En el caso de archivos que no están guardados en la caché en las ubicaciones de borde y las cachés de borde regional, Amazon CloudFront mantiene conexiones persistentes con los servidores de origen para poder recopilar esos archivos de los servidores de origen a la mayor brevedad posible.",
          "image": "https://d1.awsstatic.com/product-marketing/CloudFront/Logo_AmazonCloudFront_64.7646e0d3d8c51b92398b9b7e5b06ccdbcc4576de.png"
        },
        {
          "name": "AWS Direct Connect",
          "description": "Conexión de red privada dedicada entre tu datacenter y AWS que reduce latencia y costos de transferencia respecto a Internet público. Ideal para entornos híbridos con requisitos de rendimiento o cumplimiento; puede combinarse con enlaces redundantes y con VIFs para separar tráfico. Considera costos de puerto y cargo por uso, y planifica redundancia y failover.",
          "image": "https://d1.awsstatic.com/product-marketing/Direct%20Connect/Logo_AWSDirectConnect_64.6e3281c88dc891a5b6a8d621ef37cf64826e8e15.png"
        },
        {
          "name": "AWS Route 53",
          "description": "Servicio DNS escalable y altamente disponible que soporta resolución pública y privada, routing policies (simple, weighted, latency, failover, geolocation) y health checks. Se integra con otros servicios AWS para automatizar mapeos y soporta gestión de dominios. Casos de uso: gestión de tráfico global, failover entre regiones y balanceo DNS avanzado.",
          "image": "https://d1.awsstatic.com/product-marketing/Route53/Logo_AmazonRoute53_64.3d90e1b08e238704f6fd1a343b90274b8e8fae93.png"
        },
        {
          "name": "AWS Global Accelerator",
          "description": "Servicio que optimiza el rendimiento y disponibilidad del tráfico global hacia aplicaciones distribuidas. Utiliza la red global de AWS para enrutar tráfico mediante dos direcciones IP estáticas, mejorando la latencia y ofreciendo failover instantáneo entre regiones o endpoints. Es ideal para aplicaciones con usuarios globales, tiempo crítico o requerimientos de alta resiliencia.",
          "image": "https://d1.awsstatic.com/product-marketing/Global%20Accelerator/Logo_AWSGlobalAccelerator_64.png"
        },
        {
          "name": "Network acl",
          "description": "Una Network ACL (Lista de Control de Acceso de Red) proporciona control de tráfico a nivel de subred en una VPC. Funciona como un firewall con reglas explícitas de entrada y salida que permiten o deniegan el tráfico según criterios definidos, lo que la convierte en la herramienta más adecuada para esta necesidad.<br><br>Una AWS Network ACL (ACL de red) es un firewall virtual sin estado que funciona a nivel de subred en una VPC (Virtual Private Cloud) para permitir o denegar el tráfico de red entrante y saliente. Actúa como una capa de seguridad adicional y evalúa las reglas en orden numérico para determinar si el tráfico debe ser permitido o denegado; si no hay una regla que coincida, la regla comodín por defecto lo deniega.",
          "image": "imagen/AWS-Network-acl.jpg"
        }        
      ]
    },
    {
      "name": "Seguridad e Identidad",
      "services": [
        {
          "name": "AWS Identity and Access Management (IAM)",
          "description": "Servicio para gestionar identidades (usuarios, roles, grupos) y políticas que controlan el acceso a recursos AWS. Permite políticas basadas en JSON con permisos finos, MFA, roles temporales y federation (SAML, OIDC). Es piedra angular de la seguridad en AWS: buenas prácticas incluyen least privilege, roles para servicios y revisión periódica de políticas y credenciales.",
          "image": "imagen/AWS-IAM.JPEG"
        },
        {
          "name": "AWS Key Management Service (KMS)",
          "description": "Servicio para crear, administrar y usar claves de cifrado (symmetric y asymmetric) en AWS. Se integra con S3, EBS, RDS, Lambda y muchos servicios para cifrado en reposo y en tránsito. Ofrece claves administradas por AWS o por el cliente (CMKs) y auditoría mediante CloudTrail; es fundamental para cumplimiento y protección de datos sensibles.",
          "image": "https://d1.awsstatic.com/product-marketing/KMS/Logo_AWSKMS_64.3f4f1d2dd933d1a43c1ec640de78e42b04b2cfd8.png"
        },
        {
          "name": "AWS Shield",
          "description": "Servicio de protección contra ataques DDoS. AWS Shield Standard está incluido y protege contra ataques comunes a capa de red/transport (sin coste adicional); Shield Advanced ofrece protección adicional, detección continua, mitigaciones más avanzadas, análisis y soporte 24/7. Se integra con WAF y Route 53 para protección de aplicaciones críticas.",
          "image": "https://d1.awsstatic.com/product-marketing/Shield/Logo_AWSShield_64.01e8b4238ff5b4a26a3b90ee6b6504b77db247ee.png"
        },
        {
          "name": "AWS WAF (Web Application Firewall)",
          "description": "Firewall para aplicaciones web que permite definir reglas para bloquear, permitir o contar solicitudes HTTP(S) basadas en IP, patrones, strings o condiciones complejas. Útil para mitigar inyección SQL, XSS y otras vulnerabilidades a nivel de aplicación; puede desplegarse frente a CloudFront, ALB o API Gateway y se configura con managed rules o reglas personalizadas.",
          "image": "https://d1.awsstatic.com/product-marketing/WAF/Logo_AWSWAF_64.9a6f1d3b402a287f91dd6d8f3b7b0a55e5ff8a02.png"
        },
        {
          "name": "AWS Certificate Manager (ACM)",
          "description": "Servicio que facilita la creación, administración y renovación automática de certificados SSL/TLS para sitios web y aplicaciones. ACM elimina la necesidad de realizar instalaciones manuales y reduce el riesgo de expiración accidental. Se integra nativamente con servicios como CloudFront, Elastic Load Balancing y API Gateway. Ideal para cifrar tráfico HTTPS, asegurar comunicaciones y cumplir buenas prácticas de seguridad sin esfuerzo operativo.",
          "image": ""
        },
        {
          "name": "Amazon Macie",
          "description": "AWS Macie es un servicio de seguridad de datos que utiliza aprendizaje automático y coincidencia de patrones para descubrir, clasificar y proteger datos confidenciales en la nube de AWS. Proporciona visibilidad sobre los riesgos de seguridad de los datos y permite la protección automatizada contra ellos. Macie está diseñado para su uso en Amazon S3 y ayuda a identificar automáticamente datos como información de identificación personal (PII), números de tarjetas de crédito, etc.. ",
          "image": ""
        },
        {
          "name": "Amazon Inspector",
          "description": "AWS Inspector es un servicio de gestión automatizada de vulnerabilidades que escanea y analiza continuamente las cargas de trabajo de AWS para detectar vulnerabilidades de software y exposiciones de red no deseadas. Identifica riesgos en recursos como instancias de Amazon EC2, imágenes de contenedores (en Amazon ECR) y funciones de AWS Lambda, y luego califica los hallazgos para ayudar a priorizar y mitigar problemas de seguridad.",
          "image": ""
        }
      ]
    },
    {
      "name": "Monitoreo y Gestión",
      "services": [
        {
          "name": "Amazon CloudWatch",
          "description": "Plataforma de monitoreo para métricas, logs y eventos que ayuda a observar el estado de recursos y aplicaciones. Soporta custom metrics, dashboards, alarmas, logs insights y eventos que disparan acciones automatizadas (autoscaling, lambdas). Casos de uso: observabilidad operativa, SLOs/SLAs, alerting y análisis forense de incidencias.",
          "image": "https://d1.awsstatic.com/product-marketing/CloudWatch/Logo_AmazonCloudWatch_64.0f29a8b38ddda4c03c06b2e33b260a0b7a07dca5.png"
        },
        {
          "name": "AWS CloudTrail",
          "description": "Servicio que registra y almacena el historial de llamadas a la API de AWS (acciones de usuarios y servicios) para auditoría, gobernanza y análisis forense. CloudTrail es esencial para cumplimiento y para investigar cambios accidental o maliciosos en la cuenta; los logs pueden integrarse con CloudWatch Logs, S3 y soluciones SIEM.",
          "image": "https://d1.awsstatic.com/product-marketing/CloudTrail/Logo_AWSCloudTrail_64.4b27df7de7d9cb36af5d9d48d3c053a0dd9d6a78.png"
        },
        {
          "name": "AWS Config",
          "description": "Servicio que evalúa, registra y audita la configuración de los recursos AWS a lo largo del tiempo. Permite definir reglas de conformidad, recibir snapshots del estado de recursos y facilitar investigaciones de configuración y cumplimiento regulatorio. Es valioso para gobernanza multi-cuenta y para automatizar remediaciones mediante Lambda o Systems Manager.",
          "image": "https://d1.awsstatic.com/product-marketing/Config/Logo_AWSConfig_64.31a52061a9d83bdb8478b4a60f4b9e1d13e63e87.png"
        }
      ]
    },
  {
    "name": "Machine Learning",
    "services": [
      {
        "name": "Amazon SageMaker",
        "description": "Servicio totalmente administrado para construir, entrenar y desplegar modelos de machine learning a escala. Proporciona entornos gestionados de notebooks, algoritmos optimizados, pipelines de ML, endpoints de inferencia y capacidades de MLOps integradas. Reduce tiempo de desarrollo y elimina la gestión de infraestructura para entrenar modelos complejos. Ideal para equipos de ciencia de datos, automatización ML y aplicaciones con inferencia en tiempo real.",
        "image": "https://d1.awsstatic.com/product-marketing/SageMaker/Logo_AmazonSageMaker_64.png"
      },
      {
        "name": "Amazon Rekognition",
        "description": "Servicio basado en visión por computadora que analiza imágenes y videos usando modelos preentrenados. Detecta objetos, personas, texto, celebridades, caras y emociones. Útil para moderación de contenido, análisis de videos, control de identidad y automatización en sistemas de seguridad. No requiere conocimientos de ML, ya que ofrece APIs listas para usarse.",
        "image": "https://d1.awsstatic.com/product-marketing/Rekognition/Logo_AmazonRekognition_64.png"
      },
      {
        "name": "Amazon Comprehend",
        "description": "Servicio de procesamiento de lenguaje natural (NLP) que identifica sentimientos, temas, entidades, frases clave y clasifica texto. Usa modelos preentrenados y permite entrenar clasificadores personalizados. Casos de uso: análisis de comentarios de clientes, minería de texto, automatización de procesos legales o de soporte y extracción de insights no estructurados.",
        "image": "https://d1.awsstatic.com/product-marketing/Comprehend/Logo_AmazonComprehend_64.png"
      }
    ]
  },
  {
    "name": "Analítica",
    "services": [
      {
        "name": "Amazon Athena",
        "description": "Servicio serverless que permite ejecutar consultas SQL directamente sobre datos almacenados en S3. No requiere infraestructura ni administración, y cobra por cantidad de datos escaneados. Ideal para análisis ad-hoc, data lakes y exploración rápida de datos. Se integra con Glue Data Catalog para manejo de esquema y metadatos.",
        "image": "https://d1.awsstatic.com/product-marketing/athena/Logo_AmazonAthena_64.png"
      },
      {
        "name": "Amazon Kinesis",
        "description": "Plataforma para procesamiento y análisis de datos en streaming en tiempo real. Permite ingerir logs, eventos, métricas, clics, IoT y streaming de video. Ofrece Kinesis Data Streams, Firehose, Analytics y Video Streams. Casos de uso: monitoreo en tiempo real, dashboards de eventos, análisis de logs, y pipelines de datos en vivo.",
        "image": "https://d1.awsstatic.com/product-marketing/Kinesis/Logo_AmazonKinesis_64.png"
      },
      {
        "name": "AWS Glue",
        "description": "Servicio administrado de ETL, catalogación y preparación de datos. Automatiza la detección de esquemas, transformación y movimiento de datos entre sistemas. Glue permite construir data lakes organizados y consultables. Incluye Glue Studio para flujos visuales, Glue Jobs para ETL y Glue Crawlers para catalogación automática.",
        "image": "https://d1.awsstatic.com/product-marketing/Glue/Logo_AWSGlue_64.png"
      }
    ]
  },
  {
    "name": "Migración y Transferencia",
    "services": [
      {
        "name": "AWS Migration Hub",
        "description": "Panel centralizado para monitorizar y gestionar migraciones hacia AWS. Permite ver progreso de aplicaciones migradas usando múltiples herramientas como DMS o Server Migration Service. Ayuda a coordinar equipos, medir tiempos y centralizar el estado de migración empresarial.",
        "image": "https://d1.awsstatic.com/product-marketing/Migration%20Hub/Logo_AWSMigrationHub_64.png"
      },
      {
        "name": "AWS Database Migration Service (DMS)",
        "description": "Servicio para migrar bases de datos hacia AWS con mínima interrupción. Soporta migraciones homogéneas (ej. MySQL ➜ MySQL) y heterogéneas (ej. Oracle ➜ Aurora). Ofrece replicación continua para mantener origen y destino sincronizados. Ideal para migraciones grandes sin downtime.",
        "image": "https://d1.awsstatic.com/product-marketing/DMS/Logo_AWSDMS_64.png"
      },
      {
        "name": "AWS Snowball",
        "description": "Dispositivo físico seguro para transferencias masivas de datos hacia/desde AWS. Se utiliza cuando la transferencia por red sería muy lenta o costosa. Snowball ofrece almacenamiento local cifrado y transporte seguro. Es ideal para TB o PB de datos, proyectos remotos y migraciones a data lakes en AWS.",
        "image": "https://d1.awsstatic.com/product-marketing/Snowball/Logo_AWSSnowball_64.png"
      }
    ]
  },
  {
    "name": "Internet of Things (IoT)",
    "services": [
      {
        "name": "AWS IoT Core",
        "description": "Servicio para conectar dispositivos IoT a la nube de forma segura usando MQTT, HTTP o WebSockets. Administra autenticación, autorización, comunicación y routing de mensajes. Ideal para dispositivos inteligentes, sensores industriales y aplicaciones conectadas.",
        "image": "https://d1.awsstatic.com/product-marketing/iot-core/Logo_AWSIoTCore_64.png"
      },
      {
        "name": "AWS IoT Analytics",
        "description": "Servicio que procesa, limpia y analiza datos generados por dispositivos IoT. Ofrece pipelines de datos, almacenamiento optimizado y consultas preparadas para análisis. Útil para identificar patrones de uso, mantenimiento predictivo e integración con ML.",
        "image": "https://d1.awsstatic.com/product-marketing/IoT%20Analytics/Logo_AWSIoTAnalytics_64.png"
      },
      {
        "name": "AWS IoT Greengrass",
        "description": "Extiende AWS a dispositivos edge para ejecutar código, sincronizar datos y comunicarse localmente sin depender siempre de la nube. Permite lógica local, ML en el borde y comunicación segura. Es ideal para entornos con conectividad intermitente.",
        "image": "https://d1.awsstatic.com/product-marketing/Greengrass/Logo_AWSIoTGreengrass_64.png"
      }
    ]
  },
  {
    "name": "Seguridad adicional",
    "services": [
      {
        "name": "Amazon GuardDuty",
        "description": "Servicio de detección de amenazas basado en machine learning que analiza logs de VPC, CloudTrail y DNS para identificar comportamientos sospechosos. Detecta actividad maliciosa, accesos anómalos y patrones que indican compromiso. No requiere instalar agentes.",
        "image": "https://d1.awsstatic.com/product-marketing/GuardDuty/Logo_AmazonGuardDuty_64.png"
      },
      {
        "name": "AWS Secrets Manager",
        "description": "Servicio para gestionar, almacenar y rotar automáticamente secretos como contraseñas, llaves API y credenciales de bases de datos. Se integra con RDS, Lambda y otros servicios. Reduce riesgos al evitar almacenar secretos en código.",
        "image": "https://d1.awsstatic.com/product-marketing/Secrets%20Manager/Logo_AWSSecretsManager_64.png"
      },
      {
        "name": "AWS Security Hub",
        "description": "Servicio que centraliza alertas de seguridad desde múltiples servicios (GuardDuty, Inspector, Macie, etc.) y permite evaluar cumplimiento normativo. Proporciona vistas unificadas y recomendaciones automatizadas para mejorar la postura de seguridad.",
        "image": "https://d1.awsstatic.com/product-marketing/Security%20Hub/Logo_AWSSecurityHub_64.png"
      }
    ]
  },
  {
    "name": "DevOps",
    "services": [
      {
        "name": "AWS CodePipeline",
        "description": "Servicio para implementar pipelines CI/CD que automatizan compilación, pruebas y despliegues. Se integra con GitHub, CodeBuild, CodeDeploy y otros proveedores. Permite entregas rápidas y consistentes con menos intervención manual.",
        "image": "https://d1.awsstatic.com/product-marketing/CodePipeline/Logo_AWSCodePipeline_64.png"
      },
      {
        "name": "AWS CodeBuild",
        "description": "Servicio totalmente administrado que compila código, ejecuta tests y produce artefactos listos para despliegue. Escala automáticamente y cobra por minuto de construcción. Reemplaza servidores de build locales.",
        "image": "https://d1.awsstatic.com/product-marketing/CodeBuild/Logo_AWSCodeBuild_64.png"
      },
      {
        "name": "AWS CodeDeploy",
        "description": "Automatiza despliegues en EC2, contenedores, Lambda y servidores on-premise. Permite despliegues blue/green, canary y rolling, reduciendo riesgos y downtime. Se integra con CodePipeline y herramientas de DevOps.",
        "image": "https://d1.awsstatic.com/product-marketing/CodeDeploy/Logo_AWSCodeDeploy_64.png"
      }
    ]
  },
  {
    "name": "Mensajería",
    "services": [
      {
        "name": "Amazon SNS",
        "description": "Servicio de mensajería tipo pub/sub para enviar notificaciones a múltiples suscriptores (email, SMS, Lambda, SQS, HTTPS). Ideal para eventos inmediatos, alertas y fan-out patterns. Administra comunicación desacoplada.",
        "image": "https://d1.awsstatic.com/product-marketing/SNS/Logo_AmazonSNS_64.png"
      },
      {
        "name": "Amazon SQS",
        "description": "Servicio de colas que desacopla sistemas distribuidos permitiendo enviar, almacenar y recibir mensajes de forma segura. Ofrece colas estándar (alto throughput) y FIFO (orden estricto). Ideal para microservicios y procesamiento asíncrono.",
        "image": "https://d1.awsstatic.com/product-marketing/SQS/Logo_AmazonSQS_64.png"
      },
      {
        "name": "Amazon EventBridge",
        "description": "Bus de eventos serverless que permite conectar aplicaciones utilizando eventos en tiempo real. Facilita integrar SaaS externos con AWS. Ideal para arquitecturas event-driven y automatizaciones complejas.",
        "image": "https://d1.awsstatic.com/product-marketing/EventBridge/Logo_AmazonEventBridge_64.png"
      },
      {
        "name": "AWS AppSync",
        "description": "Servicio administrado que permite crear APIs escalables usando GraphQL. Simplifica el acceso a datos desde aplicaciones móviles y web al unificar múltiples orígenes (DynamoDB, Aurora, Lambda, HTTP, etc.) bajo un único endpoint. Soporta suscripciones en tiempo real usando WebSockets, sincronización offline y cacheo automático. Ideal para apps con actualizaciones instantáneas, colaboración, dashboards y aplicaciones móviles con conectividad variable.",
        "image": "https://d1.awsstatic.com/product-marketing/AppSync/Logo_AWSAppSync_64.png"
      },
      {
        "name": "Amazon SES (Simple Email Service)",
        "description": "Es un servicio en la nube de Amazon Web Services que permite a las empresas enviar y recibir correos electrónicos a gran escala de manera confiable y rentable. Su principal ventaja es que puede integrarse en cualquier aplicación para automatizar el envío de correos transaccionales, de marketing o notificaciones, pagando solo por el uso.<br><br>Es un servicio de envío de correos electrónicos de alta capacidad para casos de uso como marketing, notificaciones y correos transaccionales. Proporciona una interfaz SMTP, así como API, y permite gestionar la reputación, las métricas de entrega y la autenticación del correo para garantizar la eficacia de campañas masivas.",
        "image": "imagen/AWS-SES.jpg"
      },
      {
        "name": "Amazon MQ",
        "description": "Servicio administrado para brokers de mensajes compatibles con Apache ActiveMQ y RabbitMQ. Facilita la migración de sistemas que dependen de protocolos tradicionales como MQTT, AMQP, STOMP o JMS, sin necesidad de reescribir aplicaciones. Ofrece alta disponibilidad, failover automático, monitoreo integrado y administración mínima. Ideal para entornos empresariales que requieren colas tradicionales y compatibilidad con sistemas legados.",
        "image": "https://d1.awsstatic.com/product-marketing/MQ/Logo_AmazonMQ_64.png"
      }
    ]
  },
  {
    "name": "Administración y Gobernanza",
    "services": [
      {
        "name": "AWS Organizations",
        "description": "Servicio para gestionar múltiples cuentas AWS desde un punto central. Permite aplicar políticas (SCPs), consolidar facturación, segmentar ambientes y aplicar controles de seguridad consistentes. Fundamental para empresas y grandes equipos.",
        "image": "https://d1.awsstatic.com/product-marketing/Organizations/Logo_AWSOrganizations_64.png"
      },
      {
        "name": "AWS Control Tower",
        "description": "Crea un entorno multi-cuenta seguro, gobernado y listo para usarse basado en buenas prácticas de AWS. Automatiza la creación de cuentas, setup de seguridad, logs centralizados y políticas de control. Ideal para empresas que comienzan en AWS o expanden su organización.",
        "image": "https://d1.awsstatic.com/product-marketing/Control%20Tower/Logo_AWSControlTower_64.png"
      },
      {
        "name": "AWS License Manager",
        "description": "Permite gestionar licencias de software en AWS y entornos híbridos, reduciendo sobrecostos y riesgos de cumplimiento. Automatiza seguimiento de uso, asignación y restricciones de licencias.",
        "image": "https://d1.awsstatic.com/product-marketing/License%20Manager/Logo_AWSLicenseManager_64.png"
      }
    ]
  },
  {
    "name": "Aplicaciones empresariales",
    "services": [
      {
        "name": "Amazon WorkSpaces",
        "description": "Servicio de escritorios virtuales en la nube que permite ofrecer entornos Windows o Linux administrados, seguros y escalables. Ideal para teletrabajo, call centers y empresas con requisitos de acceso remoto.",
        "image": "https://d1.awsstatic.com/product-marketing/Workspaces/Logo_AmazonWorkSpaces_64.png"
      },
      {
        "name": "Amazon Chime",
        "description": "Plataforma de videoconferencias, chat y reuniones empresariales. Ofrece API para integrar comunicaciones en aplicaciones propias. Ideal para colaboración remota dentro de organizaciones.",
        "image": "https://d1.awsstatic.com/product-marketing/Chime/Logo_AmazonChime_64.png"
      },
      {
        "name": "Amazon WorkMail",
        "description": "Servicio de correo empresarial seguro y manejado por AWS. Proporciona calendarios, integración con Outlook y políticas administradas mediante AWS. Enfocado en organizaciones que requieren control y seguridad reforzada.",
        "image": "https://d1.awsstatic.com/product-marketing/WorkMail/Logo_AmazonWorkMail_64.png"
      }
    ]
  },
  {
    "name": "Conceptos",
    "services": [
      {
        "name": "Modelo de responsabilidad compartida",
        "description": "El modelo de responsabilidad compartida en AWS divide las responsabilidades de seguridad entre AWS y el cliente. AWS es responsable de la seguridad <b>de la nube</b>, que incluye la infraestructura física como los centros de datos y el hardware. El cliente es responsable de la seguridad <b>en la nube</b>, que abarca la seguridad de sus datos, aplicaciones y la configuración de los servicios que utilizan, como la gestión de acceso y cifrado. ",
        "image": "imagen/AWS-MRC.png"
      },
      {
        "name": "Elasticidad",
        "description": "La elasticidad en AWS es la capacidad de adquirir y liberar recursos informáticos (como servidores o bases de datos) automáticamente en respuesta a la demanda, lo que permite que las aplicaciones se ajusten a las fluctuaciones de carga. A diferencia de la escalabilidad, la elasticidad permite tanto aumentar como disminuir recursos de forma dinámica, asegurando el rendimiento sin pagar por capacidad de cómputo no utilizada. Servicios como AWS Auto Scaling Groups y AWS Lambda utilizan la elasticidad para ajustar automáticamente los recursos. <br><br><b>Conceptos clave:</b><ul>- Vertical: Se incrementan las capacidades de un recurso existente, por ejemplo, pasando de una instancia T2 micro a una T3 large, aunque esto a menudo requiere apagar la instancia y no se puede hacer de forma tan dinámica como el escalamiento horizontal.</ul><ul>- Horizontal: Se añaden o eliminan instancias de servidores, como lo hacen los grupos de Auto Scaling.</ul>",
        "image": ""
      },
      {
        "name": "Escalabilidad",
        "description": "La Escalabilidad, es la capacidad de un sistema de crecer y adaptarse a las necesidades de los usuarios. Habitualmente, la escalabilidad sevincula al crecimiento de los recursos de un sistema ante un incremento en la demanda de los mismos, evitando la saturación. <br><br><ul>- El Escalamiento Vertical consiste en agregar recursos a un sólo nodo, aumentando su capacidad, esto puede ser aumentando la memoria RAM del servidor, agregar discos duros de mayor capacidad, cambiar de CPU o incluso cambiar todo el servidor por uno de más capacidad</ul><ul>- El Escalamiento Horizontal consiste en agregar nodos adicionales para adaptarse a la carga de trabajo. Si la aplicación o el sistema están llegando a su punto crítico, entonces se agregan nodos adicionales y se divide la carga entre los distintos nodos</ul>",
        "image": "imagen/AWS-ESCALAMIENTOHV.png"
      },
      {
        "name": "Principio de privilegio mínimo",
        "description": "El Principio de privilegio mínimo, es una práctica recomendada en la seguridad informática que establece que a las identidades (usuarios, grupos, roles) solo se les debe permitir realizar el menor conjunto de acciones necesarias para completar una tarea específica. Esto ayuda a limitar el acceso involuntario y a realizar el seguimiento de quién tiene acceso a determinados recursos.",
        "image": ""
      },
      {
        "name": "Origin Access Control",
        "description": "El Control de Acceso de Origen (OAC por sus siglas en inglés) Es una característica de <b>Amazon CloundFront</b> que permite restringir el acceso a un origen, como un <b>bucket de S3</b>, para que solo sea accesible a través de esa distribución de CloudFront. OAC protege los archivos contra el acceso directo al URL del bucket y mejora la seguridad al permitir la autenticación basada en la entidad de servicio <b>IAM</b> de ClounFront.",
        "image": "imagen/AWS-OAC.jpg"
      },
      {
        "name": "Resource Access Manager",
        "description": "Resource Access Manager (RAM) permite compartir recursos de AWS entre cuentas, pero no controla ni restringe el acceso entre CloudFront y S3.",
        "image": ""
      },
      {
        "name": "Cross-Origin Resource Sharing",
        "description": "Cross-Origin Resource Sharing (CORS) permite que recursos web compartan datos entre diferentes dominios, pero no impide el acceso directo al bucket desde fuera de CloudFront.",
        "image": ""
      },
      {
        "name": "Field Level Encryption",
        "description": "Field-Level Encryption cifra campos específicos de formularios HTTP, pero no está relacionado con el control de acceso entre CloudFront y S3.<br>El Cifrado a Nivel de Campo (FLE) en AWS es una función de seguridad que permite cifrar datos confidenciales dentro de los campos de una solicitud antes de enviarlos al servidor.",
        "image": ""
      }
    ]
  }  
  ]
}
